QuantAsylum/QA350/MSP430 Workspace/QA350/main.c
	// ADS1256 SYNC
	//GPIO_setAsOutputPin(GPIO_PORT_P5, GPIO_PIN6);

	// ADS1256 RESET
	//GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN7);

	// ADS1256 CS
	//GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN6);

	// ADS1256 DOUT == MSP430 SPI DIN
	GPIO_setAsInputPin(GPIO_PORT_P4, GPIO_PIN5);
	GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P4, GPIO_PIN5);    // Controlled by SPI HW

	// ADS1256 DIN == MSP430 DOUT
	GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN4);
	GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_P4, GPIO_PIN4);   // Controlled by SPI HW

	// ADS1256 CLOCK
	GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN0);
	GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_P4, GPIO_PIN0);	// Controlled by SPI HW
}


//
// Init TimerA to generate an interrupt at 1 KHz
//
void InitTimerA()
{
    // Setup Timer A to generate an interrupt at 1 KHz
	Timer_A_initUpModeParam  tp;
	tp.captureCompareInterruptEnable_CCR0_CCIE = TIMER_A_CCIE_CCR0_INTERRUPT_ENABLE;
    tp.clockSource = TIMER_A_CLOCKSOURCE_ACLK;
    tp.clockSourceDivider = TIMER_A_CLOCKSOURCE_DIVIDER_64; // This is 24 MHz / 64 = 375 KHz
    tp.startTimer = true;
    tp.timerClear = TIMER_A_DO_CLEAR;
    tp.timerInterruptEnable_TAIE = TIMER_A_TAIE_INTERRUPT_DISABLE;
    tp.timerPeriod = 375;  // Divide 375K by 375 to get 1mS interrupt rate
    Timer_A_initUpMode(TIMER, &tp);
}

//
// SPI communication with ADS ADC. We'll run at 1 MHz. Max for ADS1256 is 2.5 MHz
// (see figure 1 in spec, where t2l + t2h = 400 nS = 2.5 MHz
//
void InitSPI()
{
	USCI_A_SPI_initMasterParam param;
	param.selectClockSource = USCI_A_SPI_CLOCKSOURCE_ACLK;
	param.clockSourceFrequency = UCS_getACLK();
	param.desiredSpiClock = 1000000;
	param.msbFirst = USCI_A_SPI_MSB_FIRST;
	param.clockPhase = USCI_A_SPI_PHASE_DATA_CHANGED_ONFIRST_CAPTURED_ON_NEXT; // Latch on falling
	param.clockPolarity = USCI_A_SPI_CLOCKPOLARITY_INACTIVITY_LOW;
	//param.spiMode = USCI_A_SPI_3PIN;
	USCI_A_SPI_initMaster(SPI, &param);
	USCI_A_SPI_enable(SPI);
}

//
// Send a 32-bit word via SPI
//
uint32_t SendSPI(uint32_t data)
{
	uint32_t r = 0;

	//ASSERT_CS;

	USCI_A_SPI_transmitData(SPI, data >> 24);
	r = (r << 8) + USCI_A_SPI_receiveData(SPI);

	USCI_A_SPI_transmitData(SPI, data >> 16);
	r = (r << 8) + USCI_A_SPI_receiveData(SPI);

	USCI_A_SPI_transmitData(SPI, data >> 8);
	r = (r << 8) + USCI_A_SPI_receiveData(SPI);

	USCI_A_SPI_transmitData(SPI, data >> 0);
	r = (r << 8) + USCI_A_SPI_receiveData(SPI);

	//DEASSERT_CS;

	return r;
}

// ADS1256 data notes:
// Input clock is 7.68 MHz == 130 nS
// Max sclock is 1.92 MHz
// Issuing data read to clocking out data is 6.56 uS
// Aim for 50 or 60 SPS. This is Fdata, and tau data is thus 20 mS
// The max SCLK is 10*20 mS or 200 mS
// Data should be latched on falling edge of SCLK
//

//
// Write to ADS register
//
void WriteADS1256Reg(uint8_t reg, uint8_t val)
{
	reg &= 0x0F;  // Mask register
	reg |= 0x50;  // Command

	//ASSERT_CS;

	USCI_A_SPI_transmitData(SPI, reg);   // This is the 1st command byte
	while (USCI_A_SPI_isBusy(SPI));
    USCI_A_SPI_receiveData(SPI);         // Junk read

	USCI_A_SPI_transmitData(SPI, 0);     // This is the number of bytes to write MINUS 1
	while (USCI_A_SPI_isBusy(SPI));
    USCI_A_SPI_receiveData(SPI);         // Junk read

	USCI_A_SPI_transmitData(SPI, val);   // Run the clock for 8 more cycles to write the byte
	while (USCI_A_SPI_isBusy(SPI));
	USCI_A_SPI_receiveData(SPI);         // Junk read
	//DelayUS(2);

	//DEASSERT_CS;
	//DelayUS(10);
}

//
// Read from ADS register
//
uint8_t ReadADS1256Reg(uint8_t reg)
{
	reg &= 0x0F;  // Mask register
	reg |= 0x10;  // Command

	//ASSERT_CS;

	USCI_A_SPI_transmitData(SPI, reg);   // This is the 1st command byte
	while (USCI_A_SPI_isBusy(SPI));
    USCI_A_SPI_receiveData(SPI);         // Junk read


	USCI_A_SPI_transmitData(SPI, 0);     // This is the number of bytes to read MINUS 1
	while (USCI_A_SPI_isBusy(SPI));
    USCI_A_SPI_receiveData(SPI);         // Junk read

	DelayUS(10);						// This is t6 in spec (6.5uS is the min). See Fig1 and Fig 30

	USCI_A_SPI_transmitData(SPI, 0);    // Run the clock for 8 more cycles to grab the byte
	while (USCI_A_SPI_isBusy(SPI));
	//DelayUS(2);
	//DEASSERT_CS;

	//DelayUS(10);

	return USCI_A_SPI_receiveData(SPI);
}

//
// Read data from ADS. This will block until the part is ready. If the part never
// becomes ready, then this will hang
//
uint32_t ReadADS1256Data()
{
	uint32_t data = 0;

	// SPIN while DREADY bit is high (indicating it is NOT ready)
	while (IS_DATAREADY == 0)
		;

	//ASSERT_CS;

	USCI_A_SPI_transmitData(SPI, 0x01);  // Send first command byte (command + addr)
	while (USCI_A_SPI_isBusy(SPI));
	USCI_A_SPI_receiveData(SPI);         // Junk read

	// Delay t6 (see spec: at least 6.5us) to wait for response
	DelayUS(10);

	USCI_A_SPI_transmitData(SPI, 0x00);
	while (USCI_A_SPI_isBusy(SPI));
	data = (data << 8) + USCI_A_SPI_receiveData(SPI);

	USCI_A_SPI_transmitData(SPI, 0x00);
	while (USCI_A_SPI_isBusy(SPI));
	data = (data << 8) + USCI_A_SPI_receiveData(SPI);

	USCI_A_SPI_transmitData(SPI, 0x00);
	while (USCI_A_SPI_isBusy(SPI));
	data = (data << 8) + USCI_A_SPI_receiveData(SPI);

	//DEASSERT_CS;

	return data;
}

// Issues SYNC command. Forces sampling to re-start, which will
// also cause DRDY to go high. This needs to be called whenever
// mux is changed, or pga is changed, or sample rate is changed,
// etc
void SyncADS1256()
{
	// See figure 36 in spec
	USCI_A_SPI_transmitData(SPI, 0xFC);  // Sync command
	DelayUS(10);                         // See t11 in spec. This is 3.1uS minimum
	USCI_A_SPI_transmitData(SPI, 0x00);  // Wakeup command

}


void ResetADS1256()
{
	uint8_t i;

	// Reset part. We don't have a CS, so if the comm gets out of sync with
	// the part, then the SPI bus will require 32 DRDY periods to reset. At
	// the slow sample rate, this is 12.8 seconds. So it's very important
	// to ensure SPI communications never get out of sync. But if they do
	// this will try 8 times to reset, hopefully overcoming any sync issue
	//
	// Upon reset we'll revert to 30K sample rate. And then we must
	// wait 32 cycles for the SPI bus to clear. This is 32 * 33uS = 1mS
	for (i=0; i<8; i++)
	{
		USCI_A_SPI_transmitData(SPI, 0xFE);
		DelayUS(50);
	}

	DelayUS(5000);
}

//
// Spins until ADS is ready
//
void WaitUntilDataReady()
{
	while (IS_DATAREADY == 0)
		;
}

//
// Set ADS PGA Level
void SetADS1256PGA(int pga)
{
	pga &= 0x7;
	WriteADS1256Reg(2, pga);
	SyncADS1256();

