QuantAsylum/QA350/MSP430 Workspace/QA350/main.c
	//WaitUntilDataReady(); // We can't wait, otherwise it screws up USB communications
}

// Atten Level 0 = inputs 0/1 with D3 set high (atten SSR closed)
// Atten Level 1 = inputs 2/3 with D3 set low (atten SSR open)
void SetADS1256Atten(int attenLevel)
{
	switch (attenLevel)
	{
		case 0: WriteADS1256Reg(1, 0x01); WriteADS1256Reg(4, 0x78); break;
		case 1: WriteADS1256Reg(1, 0x23); WriteADS1256Reg(4, 0x70);break;
		//case 2: WriteADS1256Reg(1, 0x43); break;
		//case 3: WriteADS1256Reg(1, 0x52); break;
	}

	SyncADS1256();

	//ADS1256SelfCal();
}

void ADS1256SelfCal()
{
	    USCI_A_SPI_transmitData(SPI, 0xF0);  // Single write of 0xF0 does selfcal
		while (USCI_A_SPI_isBusy(SPI));
	    USCI_A_SPI_receiveData(SPI);         // Junk read
}

void InitADS1256()
{
	//DEASSERT_RESET;
	//DEASSERT_SYNC;
	DelayUS(1000);

	WriteADS1256Reg(0, 0x6);  // Enable buffer and enable auto cal
	SyncADS1256();
	//WaitUntilDataReady();

	SetADS1256Atten(0);       // Select inputs 3/4. This will issue sync
	//WaitUntilDataReady();

	WriteADS1256Reg(2, 0);    // CLKout off, sensor detect off, PGA = 1
	SyncADS1256();
	//WaitUntilDataReady();

	SetADS1256SampleRate(1);
	SyncADS1256();
	//WaitUntilDataReady();
}

void SetADS1256SampleRate(uint8_t sampleRate)
{
	if (sampleRate == 0)
	{
		// Sample slow, 400mS sample period
		WriteADS1256Reg(3, 0x3); // Set to 2.5 SPS
		//WaitUntilDataReady();
	}
	else if (sampleRate == 1)
	{
		// Sample fast, 1 mS period
		WriteADS1256Reg(3, 0xA1); // Set to 1000 sps
		//WriteADS1256Reg(3, 0xC0); // Set to 3750 sps
		//WaitUntilDataReady();
	}

	SyncADS1256();
}

//
// Cycle through the LEDs to indicate to the user  we've turned on.
// This is self-time, no other timing resources needed
//
void SweepLED()
{
	volatile uint32_t i, j;
	volatile uint32_t delayVal = 30000;

	 // All LED off
	P1OUT &= ~(BIT3 | BIT2 | BIT1);

	// Sweep LEDs
	for (i=0; i<10; i++)
	{
		P1OUT |= BIT3;
		for (j=0; j<delayVal; j++);
		P1OUT &= ~(BIT3 | BIT2 | BIT1);

		P1OUT |= BIT2;
		for (j=0; j<delayVal; j++);
		P1OUT &= ~(BIT3 | BIT2 | BIT1);

		P1OUT |= BIT1;
		for (j=0; j<delayVal; j++);
		P1OUT &= ~(BIT3 | BIT2 | BIT1);
	}
}

/*  
 * ======== main ========
 */
void main (void)
{
    WDT_A_hold(WDT_A_BASE); // Stop watchdog timer

    // Minimum Vcore setting required for the USB API is PMM_CORE_LEVEL_2 .
    PMM_setVCore(PMM_CORE_LEVEL_2);

    __disable_interrupt();

    InitGPIO();
    InitClocks();

    // Indicate we've booted
    SweepLED();

    InitSPI();
    InitTimerA();

    // At this point, interrupts must be enabled as the
    // routines immediately following rely on them for timing
    __enable_interrupt();  // Enable interrupts globally

    ResetADS1256();
    DelayUS(5000);           // Safe number
    InitADS1256();
    DelayUS(5000);           // Safe number
    SetADS1256SampleRate(1); // Set fast sample rate

    USB_setup(TRUE, TRUE); // Init USB & events; if a host is present, connect

    // Enable DRDY interrupt handling.
	GPIO_enableInterrupt(GPIO_PORT_P2, GPIO_PIN5);

    while (1)
    {
        // Check the USB state and directly main loop accordingly
        switch (USB_connectionState())
        {
            // This case is executed while your device is enumerated on the
            // USB host
            case ST_ENUM_ACTIVE:

            	// Only open it if we haven't already done so
				if (!(USBHID_intfStatus(HID0_INTFNUM, &x, &y) & kUSBHID_waitingForReceive))
				{
					// Start a receive operation. Everything arrives as 2 byte packets.
					if (USBHID_receiveData(UsbBuffer, 2, HID0_INTFNUM) == kUSBHID_busNotAvailable)
					{
						// Abort receive is BUS is not available
						USBHID_abortReceive(&x,HID0_INTFNUM);
						break;
					}
					else
					{
						// The bus was available and we're waiting to receive

					}
				}
				else
				{
					// Here, we are already waiting for receive. Do nothing.
				}


                // Wait in LPM0 until a receive operation has completed
                __bis_SR_register(LPM0_bits + GIE);


                if (bDataReceiveCompleted_event)
                {
                    bDataReceiveCompleted_event = FALSE;
                    ProcessUsbData();
                }

                break;

            // These cases are executed while your device is disconnected from
            // the host (meaning, not enumerated); enumerated but suspended
            // by the host, or connected to a powered hub without a USB host
            // present.
            case ST_PHYS_DISCONNECTED:
            case ST_ENUM_SUSPENDED:
            case ST_PHYS_CONNECTED_NOENUM_SUSP:
                __bis_SR_register(LPM3_bits + GIE);
                _NOP();
                break;

            // The default is executed for the momentary state
            // ST_ENUM_IN_PROGRESS.  Usually, this state only last a few
            // seconds.  Be sure not to enter LPM3 in this state; USB
            // communication is taking place here, and therefore the mode must
            // be LPM0 or active-CPU.
            case ST_ENUM_IN_PROGRESS:
            default:;
        }

    }  //while(1)
} //main()

//
// Called from the main loop above. this handles all the USB command processing
//
void ProcessUsbData()
{
	uint8_t i;
    uint32_t data;

	// Here, data was received. The first byte is the command
	switch (UsbBuffer[0])
	{
		case 0:
			// This is a kick command. Light the LED for another 1000 mS
			LEDConnected = 1000;  	// 1 second timeout
			break;

		case 1:
			// Read last ADC reading. This won't disturb the fifo
			LEDCommand = 100; 		// 100 mS flash

			data = FifoPeekLastPushed();

			UsbBuffer[0] = data >> 24;
			UsbBuffer[1] = data >> 16;
			UsbBuffer[2] = data >> 8;
			UsbBuffer[3] = data >> 0;

			if (hidSendDataInBackground( UsbBuffer, USB_BUF_LEN, HID0_INTFNUM,0))
			{
				// Operation may still be open; cancel it if the
				// send fails, escape the main loop
				USBHID_abortSend(&x,HID0_INTFNUM);
				break;
			}
			else
			{
				// Send was successful

