QuantAsylum/QA350/MSP430 Workspace/QA350/main.c
			}
			break;

		case 2:
			// Set PGA
			SetADS1256PGA(UsbBuffer[1]);
			break;

		case 3:
			// Set attentuator
			SetADS1256Atten(UsbBuffer[1]);
			break;

		case 4:
			// Stream data. Grab 12 words / 48 bytes from the FIFO
			LEDCommand = 100; 		// 100 mS flash

			for (i=0; i<48; i+=4)
			{
				data = FifoPop();
				UsbBuffer[i+0] = data >> 24;
				UsbBuffer[i+1] = data >> 16;
				UsbBuffer[i+2] = data >> 8;
				UsbBuffer[i+3] = data >> 0;
			}

			if (hidSendDataInBackground( UsbBuffer, USB_BUF_LEN, HID0_INTFNUM,0))
			{
				// Operation may still be open; cancel it if the
				// send fails, escape the main loop
				USBHID_abortSend(&x,HID0_INTFNUM);
				break;
			}
			else
			{
				// Send was successful

			}
			break;

		case 5:
			// Query fifo count. If more than 12, then host can pull a full buffer
			data = FifoCount();
			UsbBuffer[0] = data >> 24;
			UsbBuffer[1] = data >> 16;
			UsbBuffer[2] = data >> 8;
			UsbBuffer[3] = data >> 0;

			if (hidSendDataInBackground( UsbBuffer, USB_BUF_LEN, HID0_INTFNUM,0))
			{
				// Operation may still be open; cancel it if the
				// send fails, escape the main loop
				USBHID_abortSend(&x,HID0_INTFNUM);
				break;
			}
			else
			{
				// Send was successful

			}
			break;

		case 253:
			// Read serial number
			data = 12345678;
			UsbBuffer[0] = data >> 24;
			UsbBuffer[1] = data >> 16;
			UsbBuffer[2] = data >> 8;
			UsbBuffer[3] = data >> 0;

			if (hidSendDataInBackground( UsbBuffer, USB_BUF_LEN, HID0_INTFNUM,0))
			{
				// Operation may still be open; cancel it if the
				// send fails, escape the main loop
				USBHID_abortSend(&x,HID0_INTFNUM);
				break;
			}
			else
			{
				// Send was successful

			}
			break;

		case 254:
			// Read software version
			data = 10;
			UsbBuffer[0] = data >> 24;
			UsbBuffer[1] = data >> 16;
			UsbBuffer[2] = data >> 8;
			UsbBuffer[3] = data >> 0;

			if (hidSendDataInBackground( UsbBuffer, USB_BUF_LEN, HID0_INTFNUM,0))
			{
				// Operation may still be open; cancel it if the
				// send fails, escape the main loop
				USBHID_abortSend(&x,HID0_INTFNUM);
				break;
			}
			else
			{
				// Send was successful

			}
			break;

		case 255:
			// Update MSP430 Firmware. See section 3.8.1 in http://www.ti.com/lit/ug/slau319l/slau319l.pdf
			__disable_interrupt();
			USBKEYPID = 0x9628;  		// Unlock USB configuration registers
			USBCNF &= ~PUR_EN; 			// Set PUR pin to hi-Z, logically disconnect from host
			USBPWRCTL &= ~VBOFFIE; 		// Disable VUSBoff interrupt
			USBKEYPID = 0x9600; 		// Lock USB configuration register
			__delay_cycles(500000);
			((void (*)())0x1000)(); 	// Call BSL

			break;
	}

}

//
// ISR Code
//
#pragma vector=PORT2_VECTOR
__interrupt void Port_5(void)
{
	uint32_t data = ReadADS1256Data();
	FifoPush(data);
	GPIO_clearInterruptFlag(GPIO_PORT_P2, GPIO_PIN5);
}



#pragma vector=TIMER0_A0_VECTOR
__interrupt void Timer0_A0 (void)
{
	++SysTicks;

	// Indicate link is present. Top LED of hardware is BIT3
	if (LEDConnected > 0)
	{
		--LEDConnected;
		P1OUT |= BIT3;
	}
	else
	{
		P1OUT &= ~BIT3;
	}

	// Indicate LED Command. Middle LED is BIT2
	if (LEDCommand > 0)
	{
		--LEDCommand;
		P1OUT |= BIT2;
	}
	else
	{
		P1OUT &= ~BIT2;
	}

	// Stable LED Indicates power has been applied for > 10 minutes (600K ticks). Bottom LED is BIT1.
	// BUGBUG 2^32 mS = 1100 hours. This means the Stable LED will go off after 1100 hours
	// of being on
	if (SysTicks > 600000L)
	{
		P1OUT |= BIT1;
	}
	else
	{
		P1OUT &= ~ BIT1;
	}
}


/*  
 * ======== UNMI_ISR ========
 */
#if defined(__TI_COMPILER_VERSION__) || (__IAR_SYSTEMS_ICC__)
#pragma vector = UNMI_VECTOR
__interrupt void UNMI_ISR (void)
#elif defined(__GNUC__) && (__MSP430__)
void __attribute__ ((interrupt(UNMI_VECTOR))) UNMI_ISR (void)
#else
#error Compiler not found!
#endif
{
    switch (__even_in_range(SYSUNIV, SYSUNIV_BUSIFG ))
    {
        case SYSUNIV_NONE:
            __no_operation();
            break;
        case SYSUNIV_NMIIFG:
            __no_operation();
            break;
        case SYSUNIV_OFIFG:
#ifndef DRIVERLIB_LEGACY_MODE
            UCS_clearFaultFlag(UCS_XT2OFFG);
            UCS_clearFaultFlag(UCS_DCOFFG);
            SFR_clearInterrupt(SFR_OSCILLATOR_FAULT_INTERRUPT);
#else
            UCS_clearFaultFlag(UCS_BASE, UCS_XT2OFFG);
            UCS_clearFaultFlag(UCS_BASE, UCS_DCOFFG);
            SFR_clearInterrupt(SFR_BASE, SFR_OSCILLATOR_FAULT_INTERRUPT);
#endif
            break;
        case SYSUNIV_ACCVIFG:
            __no_operation();
            break;
        case SYSUNIV_BUSIFG:
            // If the CPU accesses USB memory while the USB module is
            // suspended, a "bus error" can occur.  This generates an NMI.  If
            // USB is automatically disconnecting in your software, set a
            // breakpoint here and see if execution hits it.  See the
            // Programmer's Guide for more information.
            SYSBERRIV = 0; //clear bus error flag
            USB_disable(); //Disable
    }
}

//
// Utils
//

//
// delays the specified number of milliseconds
//
void Delay(uint32_t delayMS)
{
	uint32_t target = GetSysTime() + delayMS;

	while (SysTicks < target)
		;
}

//
// Delays specified number of microseconds. This is not exact
//
void DelayUS(uint16_t delayUS)
{
	if (delayUS == 0)
		return;

	// Main CPU runs at 24 MHz, so 24 cycles = 1 microsecond. After tuning
	// looks like the real value is 35
	while (delayUS--)
		__delay_cycles(24);
}

//
// Returns the number of half milliseconds elapsed since boot
//
uint32_t GetSysTime()
{
	uint32_t time;

	// Need to disable while copying as ISR could corrupt the copying of the 4 bytes
	_DINT();
	time = SysTicks;
	_EINT();

	return time;
}

//Released_Version_4_20_00
